app/controllers/pages_controller.rb

  def profile
      User.find_by_username!(params[:username])

      @projects = Project.all.where("user_id = ?", User.find_by_username(params[:id]).id)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "username"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "projects".* FROM "projects" WHERE (user_id = 12)  ORDER BY "projects"."created_at" DESC